Tekla Open API Reference for Tekla Structures 2025
ProfileItemParameter.CrossSectionNumber Property
 The number of the cross section the parameter belongs to.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int CrossSectionNumber { get; }
Public ReadOnly Property CrossSectionNumber As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ProfileItemParameter Class
Tekla.Structures.Catalogs Namespace